{
    "token_to_idx": {
        "SOS": 0,
        "EOS": 1,
        "PAD": 2,
        "\\alpha": 3,
        "\\beta": 4,
        "\\gamma": 5,
        "\\delta": 6,
        "\\epsilon": 7,
        "\\zeta": 8,
        "\\eta": 9,
        "\\theta": 10,
        "\\iota": 11,
        "\\kappa": 12,
        "\\lambda": 13,
        "\\mu": 14,
        "\\nu": 15,
        "\\xi": 16,
        "\\pi": 17,
        "\\rho": 18,
        "\\sigma": 19,
        "\\tau": 20,
        "\\upsilon": 21,
        "\\phi": 22,
        "\\chi": 23,
        "\\psi": 24,
        "\\omega": 25,
        "\\sum": 26,
        "\\prod": 27,
        "\\int": 28,
        "\\partial": 29,
        "\\infty": 30,
        "\\sqrt": 31,
        "\\frac": 32,
        "{": 33,
        "}": 34,
        "_": 35,
        "^": 36,
        "=": 37,
        "+": 38,
        "-": 39,
        "*": 40,
        "/": 41,
        "(": 42,
        ")": 43,
        "[": 44,
        "]": 45,
        "\\left": 46,
        "\\right": 47,
        "\\begin": 48,
        "\\end": 49,
        "matrix": 50,
        "array": 51,
        "&": 52,
        "\\\\": 53,
        "0": 54,
        "1": 55,
        "2": 56,
        "3": 57,
        "4": 58,
        "5": 59,
        "6": 60,
        "7": 61,
        "8": 62,
        "9": 63,
        "a": 64,
        "b": 65,
        "c": 66,
        "d": 67,
        "x": 68,
        "y": 69,
        "z": 70,
        "\\cdot": 71,
        "\\times": 72,
        "\\leq": 73,
        "\\geq": 74,
        "\\neq": 75,
        "\\approx": 76,
        "\\sin": 77,
        "\\cos": 78,
        "\\tan": 79,
        "\\log": 80,
        "\\ln": 81,
        "\\lim": 82,
        "\\rightarrow": 83,
        "\\leftarrow": 84,
        "\\to": 85,
        " ": 86,
        ".": 87,
        ",": 88,
        ":": 89,
        ";": 90,
        "!": 91,
        "?": 92,
        "'": 93,
        "\"": 94,
        "|": 95,
        "<": 96,
        ">": 97,
        "\\div": 98,
        "\\pm": 99
    },
    "idx_to_token": {
        "0": "SOS",
        "1": "EOS",
        "2": "PAD",
        "3": "\\alpha",
        "4": "\\beta",
        "5": "\\gamma",
        "6": "\\delta",
        "7": "\\epsilon",
        "8": "\\zeta",
        "9": "\\eta",
        "10": "\\theta",
        "11": "\\iota",
        "12": "\\kappa",
        "13": "\\lambda",
        "14": "\\mu",
        "15": "\\nu",
        "16": "\\xi",
        "17": "\\pi",
        "18": "\\rho",
        "19": "\\sigma",
        "20": "\\tau",
        "21": "\\upsilon",
        "22": "\\phi",
        "23": "\\chi",
        "24": "\\psi",
        "25": "\\omega",
        "26": "\\sum",
        "27": "\\prod",
        "28": "\\int",
        "29": "\\partial",
        "30": "\\infty",
        "31": "\\sqrt",
        "32": "\\frac",
        "33": "{",
        "34": "}",
        "35": "_",
        "36": "^",
        "37": "=",
        "38": "+",
        "39": "-",
        "40": "*",
        "41": "/",
        "42": "(",
        "43": ")",
        "44": "[",
        "45": "]",
        "46": "\\left",
        "47": "\\right",
        "48": "\\begin",
        "49": "\\end",
        "50": "matrix",
        "51": "array",
        "52": "&",
        "53": "\\\\",
        "54": "0",
        "55": "1",
        "56": "2",
        "57": "3",
        "58": "4",
        "59": "5",
        "60": "6",
        "61": "7",
        "62": "8",
        "63": "9",
        "64": "a",
        "65": "b",
        "66": "c",
        "67": "d",
        "68": "x",
        "69": "y",
        "70": "z",
        "71": "\\cdot",
        "72": "\\times",
        "73": "\\leq",
        "74": "\\geq",
        "75": "\\neq",
        "76": "\\approx",
        "77": "\\sin",
        "78": "\\cos",
        "79": "\\tan",
        "80": "\\log",
        "81": "\\ln",
        "82": "\\lim",
        "83": "\\rightarrow",
        "84": "\\leftarrow",
        "85": "\\to",
        "86": " ",
        "87": ".",
        "88": ",",
        "89": ":",
        "90": ";",
        "91": "!",
        "92": "?",
        "93": "'",
        "94": "\"",
        "95": "|",
        "96": "<",
        "97": ">",
        "98": "\\div",
        "99": "\\pm"
    }
}
